Repository: BlueLightJapan/pmt.mcpe.fun
Catalog: lang/*/LC_MESSAGES/phar.po
Languages: fr_fr

source: Create phar
fr_fr: Créer une archive phar

source: Phar maker
fr_fr: Constructeur de phar

source: How to use
fr_fr: Comment l'utiliser

source: Write your plugin, of course :D
fr_fr: Programmez votrez plugin :D

source: Put your files in the correct structure (according to namespaces, etc.)
fr_fr: Mettez vos fichier comme dans un plugin normal

source: Create a ZIP file and throw your structure into it. You can put it anywhere inside the ZIP file, but only the folder with plugin.yml (and subfolders) will be included.
fr_fr: Créez un ZIP et mettez y votre plugin. Vous pouvez le mettre n'importe où dans le ZIP mais seulement le dossier et le plugin.yml (et ses sous dossiers) sera inclus.

source: Upload that file below :)
fr_fr: Uploadez ce fichier dessous :)

source: Stub (Leave as default unless you know what it is):
fr_fr: Stub (N'y touchez pas si vous ne savez pas ce que vous faites !):

source: Use the PocketMine-MP.phar stub
fr_fr: Utiliser le stub d'un PocketMine-MP.phar

source: Tune the plugin using the following methods:
fr_fr: Réglez votre plugin avec les méthodes ci dessous.

source: Optimize constant references by adding a <code>\</code> prefix to indicate that it is a top namespace reference.
fr_fr: Optimiser les constantes en ajoutant un <code>\</code> en préfix pour indiquer que c'est la référence de nom principale.

source: Obfuscate code
fr_fr: Rendez votre code illisible (plus rapide à l'execution ;) )

source: Warning: Using any of the tunes may stripe out all the comments in your code <em>except</em> PHP doc comments or line comments.
fr_fr: Attention: Utiliser un de ces réglage peut supprimer tous vos commentaires <em>excepté</em> les commentaire PHP doc ou les commentaires en ligne

source: Carry out the following inspections too:
fr_fr: Pensez aussi à ces inspections:

source: Check classpath
fr_fr: Vérifier les chemins des classes

source: Scan for bad practice
fr_fr: Scanner les mauvaises pratiques

source: Syntax error lint scan
fr_fr: Vérifier la syntaxe

source: create phar
fr_fr: Créer le phar
